# CanBePrinted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..CanBePrinted Property
View Class See Also
---
Test whether the view can be printed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool CanBePrinted { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CanBePrinted As Boolean
	Get
```

Visual C++
---
```text
public:
property bool CanBePrinted {
	bool get ();
}
```

# See Also
View Class
Autodesk.Revit.DB Namespace